---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FlexPipe..::..Create Method
FlexPipe Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, ElementId, ElementId, ElementId, IList<(Of <<'(XYZ>)>>)) | Creates a new flexible pipe into the document, using a point array and flex pipe type. |
|  | Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ, IList<(Of <<'(XYZ>)>>)) | Creates a new flexible pipe into the document, using a point array and flex pipe type. |

# See Also

FlexPipe Class

FlexPipe Members

Autodesk.Revit.DB.Plumbing Namespace